/* Задача-1
Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює останій літері str2. В іншому випадку функція повинна повернути булеве значення false.  */

/* function checkIfEquals(str1, str2) {
  const first = str1[0];
  const second = str2[str2.length - 1];
  return first === second;
}
console.log(checkIfEquals('що небуть', 'як буде')); */

/* Задача-6
Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 ділиться на num2 без остачі. В іншому випадку функція повинна повернути булеве значення false. */

/* function number(num1, num2) {
  return num1 % num2 === 0;
}
console.log(number(10, 5)); */

/* Задача-7
Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є непарним числом. В іншому випадку функція повинна повернути булеве значення false. */

/* function number(num) {
  return num % 2 === 0;
}
console.log(number(40)); */
